API/app/controllers/api/v1/users_controller.rb

    def login
      user = User.find_by_uid(params[:userParams][:id])
      if user.nil?
        user = User.new
        user.provider = "facebook"
        user.uid = params[:userParams][:id]
        user.email = params[:userParams][:email]
        user.name = params[:userParams][:name]
        user.hometown = params[:userParams][:hometown][:name].split(',').first
        user.oauth_token = params[:loginParams][:accessToken]
        user.save!
      end

      locations = Location.where("user_id = ?", user.id).count
---
SELECT  "USERS".* FROM "USERS" WHERE "USERS"."UID" = :a1 AND ROWNUM <= 1   [["uid", "1108190122539699"]]
SELECT COUNT(*) FROM "LOCATIONS" WHERE (user_id = 10117)

    def get_most_visited_cities
      user_id = verify_user_id params[:user_id]
      user = User.find(user_id)
---
SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1 AND ROWNUM <= 1   [["id", 10117]]